Repository: common-repository/wp-media-player
Catalog: languages/wp-media-player-*.po
Languages: be_by

source: File
be_by: Файл

source: successfully uploaded!
be_by: Паспяхова загружаны!

source: The uploaded file exceeds the max. upload filesize directive in the server configuration.
be_by: Загружаны файл перавышае максімальны памер, дазволены серверам.

source: The uploaded file exceeds the MAX_FILE_SIZE directive that was specified in the html form.
be_by: Загружаны файл перавышае MAX_FILE_SIZE дырэктыву, паказаную ў html форме.

source: The uploaded file was only partially uploaded
be_by: Загружаны файл быў загружаны неполностью

source: No file was uploaded
be_by: Файл не загрузіўся

source: Please select a file for upload.
be_by: Абярыце файл для загрузкі.

source: Only files with the following extensions are allowed:
be_by: Можна загружаць толькі файлы са следуюшими пашырэннямі:

source: Sorry, the filename contains invalid characters. Use only alphanumerical chars and separate parts of the name (if needed) with an underscore. A valid filename ends with one dot followed by the extension.
be_by: Імя файла содержить недазволеныя знакі. Выкарыстоўвайце толькі літары і лічбы і падзяляйце часткі імя подчерком. Правільнае імя файла сканчаецца кропкай, за якой варта пашырэнне.

source: The filename exceeds the maximum length of
be_by: Імя файла перавышае масксимальную даўжыню

source: characters.
be_by: знакаў.

source: Sorry, the upload directory doesn't exist!
be_by: Няма дырэкторыі для загрузкі!

source: Uploading
be_by: Загружаны

source: Sorry, a file with this name already exists.
be_by: Файл з такім імем ужо існуе.

source: The uploaded file is renamed to
be_by: Загружаны файл пераназваны ў

source: The file %s does not exist.
be_by: Файл %s не існуе.

source: B
be_by: Б

source: kB
be_by: кб

source: MB
be_by: мб

source: GB
be_by: гб

source: Cheatin&#8217; uh?
be_by: Хітрыце, так?

source: You do not have sufficient permissions to access this page.
be_by: У вас няма доступу да гэтай старонкі

source: About WP Media Player Plugin
be_by: О WP Медыя Прайгравальніку

source: To add a player to a blog post or a page, follow these steps:
be_by: Каб дадаць прайгравальнік у запіс:

source: <strong>Step 1</strong>: Encode the video to a Windows Media Video (WMV) format by using <a href="http://www.microsoft.com/Expression/try-it/default.aspx">Microsoft Expression Encoder</a> or <a href="http://www.microsoft.com/windows/windowsmedia/forpros/encoder/default.mspx">Windows Media Encoder</a>. If you use Windows Media Encoder then follow <a href="http://ruslany.net/wp-media-player/video-encoding/" target="_blank">these instructions</a> to properly encode the video content for Silverlight.
be_by: <strong>Крок 1</strong>: Закадуйце відэа ў Windows Media Video (WMV) фармаце з выкарыстаннем <a href="http://www.microsoft.com/Expression/try-it/default.aspx">Microsoft Expression Encoder</a> ці <a href="http://www.microsoft.com/windows/windowsmedia/forpros/encoder/default.mspx">Windows Media Encoder</a>. Калі вы выкарыстоўваеце Windows Media Encoder, то вынікайце <a href="http://ruslany.net/wp-media-player/video-encoding/" target="_blank">гэтым інструкцыям</a>, каб правільна закадаваць відэа для Silverlight.

source: <strong>Step 2</strong>: Upload the video to WordPress either via FTP or by clicking on “Silverlight Video” in the post editing page. When uploading the video, take a note of the absolute URL path where the video file has been placed to.
be_by: <strong>Крок 2</strong>: Загрузіце відэа файл у WordPress з дапамогай FTP ці з дапамогай "Silverlight Відэа" кнопкі на старонцы рэдагавання запісу. Пры загрузцы відэа запомніце адрас па якім быў захаваны відэа файл.

source: <strong>Step 3</strong>: Place the following tag inside of the blog post content where you want the video player to appear:
be_by: <strong>Крок 3</strong>: Дадайце следуюший таг у тое месца внутни запісы ці старонкі, дзе вы жадаеце змясціць прайгравальнік:

source: Usage examples
be_by: Прыклады выкарыстання

source: To use a custom placeholder image instead of the default one use the "thumb" parameter, e.g.:
be_by: Выкарыстоўвайце "thumb" параметр, каб змяніць малюначак у прайгравальніку:

source: To specify player's width and height, use the "width" and "height" parameters, e.g.:
be_by: Выкарыстоўвайце параметры "width" і "height", каб змяніць шырыню і вышыню прайгравальніка:

source: To change auto load and auto play settings use "autoLoad" and "autoPlay" parameters, e.g.:
be_by: Выкарыстоўвайце параметры "autoLoad" і "autoPlay", каб змяніць аўта-загрузку і аўта-старт:

source: To mute the audio, use the "muted" parameter, e.g.:
be_by: Выкарыстоўвайце параметр "muted", каб выключыць гук:

source: WP Media Player Settings
be_by: Налады WP Медыя Прайгравальніка

source: Default Settings
be_by: Налады па змаўчанні

source: These setting for media player will be used by default unless overwritten by corresponding settings for each individual player instance.
be_by: Гэтыя налады для прайгравальніка будуць скарыстаны па змаўчанні, калі соответсвующие налады не паказаны ў самым прайгравальніку.

source: Load and Play Options
be_by: Налады загрузкі і прайграванні

source: Cue Video on Page Load
be_by: Загружаць відэа пры загрузцы старонкі

source: Automatically Start Video when Cued
be_by: Гуляць відэа адразу пры загрузцы

source: Mute the Audio
be_by: Выключыць гук

source: (These settings may be overridden for individual players)
be_by: (Гэтыя параметны могуць быць зменены ў індывідуальных прайгравальніках)

source: Player Size
be_by: Памер прайгравальніка

source: Width
be_by: Шырыня

source: Height
be_by: Вышыня

source: Thumbnail path (optional)
be_by: Шлях да малюначка (можна не паказваць)

source: (If left empty then default thumbnail will be used)
be_by: (Калі не паказаны, то будзе выкарыстоўвацца катринка па змаўчанні)

source: Player styles
be_by: Стылі прайгравальніка

source: Select how the media player will look like.
be_by: Абярыце, як будзе выглядить прайгравальнік.

source: Style
be_by: Стыль

source: Watermark Image
be_by: Вадзяны знак

source: The watermak can be used to display the logo image on every video that is played by the player.
be_by: Вадзяны знак выкарыстоўваецца для паказу лагатыпа на кожным відэа ў прайгравальніку.

source: Image Path <br/> (JPG, PNG only)
be_by: Адрас файла з малюначкам <br/>(толькі JPG і PNG)

source: (For example: http://myblog.com/wp-content/uploads/logo.png)
be_by: (напрыклад: http://myblog.com/wp-content/uploads/logo.png)

source: Position
be_by: Размяшчэнне

source: Opacity
be_by: Непразрыстасць

source: Displaying Player on Home Page
be_by: Паказваць прайгравальнік на галоўнай старонцы

source: By default players in the blog posts are not displayed on a home page of the blog. Instead links to the players are displayed. This way blog visitors will not be reqired to download media player scripts if they do not want to see the video. Also, this prevents the possibility of multiple players in different blog posts from starting playing at the same time. You can change this behavior by using the option below.
be_by: Па змаўчанні прайгравальнікі ў запісах не паказваюцца на галоўнай старонцы. Замест іх паказваюцца спасылкі на пэўныя запісы з прайгравальнікамі. Гэта робіцца для таго, каб посетилели, якія не жадаюць глядзець відэа, не былі змушаны спампоўваць файлы прайгравальніка. Таксама, гэта прадухіляе магчымасць прайгравання некалькіх відэа адначасова. Вы можаце змяніць гэта з дапамогай налады ніжэй.

source: Show Player on Home Page
be_by: Паказваць прайгравальнік на галоўнай старонцы

source: Save Changes
be_by: Захаваць змены

source: Post ID
be_by: Нумар

source: Post Title
be_by: Запіс

source: Video File
be_by: URL відэа файла

source: Started
be_by: Пачалі

source: Finished
be_by: Скончылі

source: Ascending
be_by: узрастанню

source: Descending
be_by: змяншэнню

source: WP Media Player Statistics
be_by: Статыстыка прайграванняў відэа

source: Displaying records <strong>%s</strong> to <strong>%s</strong> of total <strong>%s</strong> records.
be_by: Паказ запісаў з <strong>%s</strong> па <strong>%s</strong> з усіх <strong>%s</strong> запісаў.

source: Sorted by <strong>%s</strong> in <strong>%s</strong> order.
be_by: Адсартавана па <strong>%s</strong> па <strong>%s</strong>.

source: Video File Path or URL
be_by: URL відэа файла

source: Reset
be_by: Скід

source: No Statistics Found
be_by: Пакуль няма дадзеных

source: Previous Page
be_by: Папярэдні

source: Next Page
be_by: Наступны

source: Pages (%s):
be_by: Старонкі (%s):

source: Go to First Page
be_by: На першую старонку

source: First
be_by: Першая

source: Go to Page
be_by: На старонку

source: Page
be_by: Старонка

source: Go to Last Page
be_by: На апошнюю старонку

source: Last
be_by: Апошняя

source: Sort Options:
be_by: Сартаванне па:

source: Per Page
be_by: Запісаў на старонку

source: Go
be_by: Абнавіць

source: Blue
be_by: Сіні

source: Gray
be_by: Шэры

source: You do not have permission to upload files.
be_by: У вас няма доступу для загрузкі файлаў.

source: Uploads
be_by: Загрузка

source: Choose Video
be_by: Абярыце відэа

source: Video Library
be_by: Відэа бібліятэка

source: <div id="media-upload-error">No file selected</div>
be_by: <div id="media-upload-error">Файл не абраны</div>

source: Choose video source
be_by: Абярыце відэа файл

source: Upload Video File
be_by: Загрузка відэа файла

source: Max. filesize =
be_by: Макс. памер файла =

source: &mdash; OR &mdash;
be_by: &mdash; ЦІ &mdash;

source: Video File URL
be_by: URL відэа файла

source: e.g. http://www.someserver.com/videos/somevideo.wmv
be_by: напрыклад: http://www.someserver.com/videos/somevideo.wmv

source: Add Video File
be_by: Дадаць відэа файл

source: Size
be_by: Памер

source: Action
be_by: Аперацыя

source: Insert
be_by: Уставіць

source: Previous
be_by: Папярэдні

source: Next
be_by: Наступны

source: Insert media player into post
be_by: Уставіць прайгравальнік у запіс

source: Video Source URL:
be_by: URL відэа файла:

source: Load and Play <br />options
be_by: Налады загрузкі <br/>і прайграванні

source: Player Width
be_by: Шырыня прайгравальніка

source: Player Height
be_by: Вышыня прайгравальніка

source: Thumbnail Path (optional)
be_by: Памер малюначка (можна не паказваць)

source: Insert into Post
be_by: Уставіць у запіс

source: Top and Left
be_by: Угары і злева

source: Top and Right
be_by: Угары і справа

source: Bottom and Left
be_by: Унізе і злева

source: Bottom and Right
be_by: Унізе і справа

source: Play Video
be_by: Гуляць відэа

source: Media Player
be_by: Медыя Прайгравальнік

source: Statistics
be_by: Статыстыка

source: Settings
be_by: Налады

source: About
be_by: Інфармацыя

source: Silverlight Video
be_by: Silverlight Відэа

source: WP Media Player
be_by: WP Прайгравальнік

source: A Silverlight-based media player.
be_by: Silverlight відэа прайгравальнік.

source: Ruslan Yakushev
be_by: Руслан Якушаў
